src/cf/InformationRegisters/уатНастройкиЗаполненияПоУслугам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатНастройкиЗаполненияПоУслугам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатШаблоныЗаполненияПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатПолучателиУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатПолучателиУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашаОрганизация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/уатШаблоныЗаполненияПоУслугам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатШаблоныЗаполненияПоУслугам</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РежимЗаполнения</Name>
					<Comment>0 - предоставленными, 1 - невыставленными</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательУслуг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатПолучателиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СворачиватьПоПолямДетализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДанныеТТД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДанныеЗаказНаТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДанныеЗаказПеревозчику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДанныеМаршрутныйЛист</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДанныеКорректировкаЗаписей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДанныеРекламаций</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДанныеЗаказТакси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДанныеАрендаТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДанныеСтраховойСертификат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СортировкаЗаказов</Name>
					<Comment>0 - дата заказа , 1 - время отправления, 2 - время прибытия</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматДаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДетализацияЗаполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолеРегистра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonForms/уатНастройкиВводаНаОсновании/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Автотест = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Автотест Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если ВладелецФормы = Неопределено Тогда
		Отказ = Истина;
				ТекстНСТР = НСтр("en='Immediate opening for this object is prohibited!';"
"ru='Непосредственное открытие для данного объекта запрещено!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		Возврат;
	ИначеЕсли НЕ ВладелецФормы.Объект.Свойство("ДоговорКонтрагента")
		ИЛИ НЕ ЗначениеЗаполнено(ВладелецФормы.Объект.ДоговорКонтрагента) Тогда
		Отказ = Истина;
		ТекстНСТР = НСтр("ru = 'Для изменения настроек заполнения по услугам в документе необходимо указать договор контрагента.'; en = 'To change the settings for filling in services in a document, you must specify the counterparty agreement.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		Возврат;
	КонецЕсли;
	
	ДокументОснование = ВладелецФормы.Объект.Ссылка;
	ДокументОснование_ДоговорКонтрагента = ВладелецФормы.Объект.ДоговорКонтрагента;
	Если ВладелецФормы.Объект.Свойство("Контрагент") Тогда
		ДокументОснование_Контрагент = ВладелецФормы.Объект.Контрагент;
	ИначеЕсли ВладелецФормы.Объект.Свойство("Перевозчик") Тогда
		ДокументОснование_Контрагент = ВладелецФормы.Объект.Перевозчик;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.уатРеализацияУслуг")
		ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.уатСчетНаОплатуПокупателю") Тогда
		ПолучательУслуг = ПредопределенноеЗначение("Перечисление.уатПолучателиУслуг.Контрагент");
	Иначе
		ПолучательУслуг = ПредопределенноеЗначение("Перечисление.уатПолучателиУслуг.НашаОрганизация");
	КонецЕсли;
	
	ВосстановитьНастройки();
	ОтобразитьИнформациюПоНастройкам();
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗаписьНастроекЗаполненияПоУслугам" Тогда
		ВосстановитьНастройки();
		ОтобразитьИнформациюПоНастройкам();
		УстановитьВидимость();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьНастройкуПоДоговору(Команда)
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения",
		Новый Структура("Контрагент, Договор",
		ДокументОснование_Контрагент, ДокументОснование_ДоговорКонтрагента));
	ОткрытьФорму("РегистрСведений.уатНастройкиЗаполненияПоУслугам.Форма.ФормаЗаписи",
		ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНастройкуПоДоговору(Команда)
	ПараметрыФормы = Новый Структура("Ключ",
		КлючЗаписиРегистраНастроек(ДокументОснование_Контрагент, ДокументОснование_ДоговорКонтрагента));
	ОткрытьФорму("РегистрСведений.уатНастройкиЗаполненияПоУслугам.Форма.ФормаЗаписи",
		ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВсеНастройкиЗаполнения(Команда)
	ОткрытьФорму("РегистрСведений.уатНастройкиЗаполненияПоУслугам.Форма.ФормаСписка");
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВосстановитьНастройки()
	
	Если Не ЗначениеЗаполнено(ДокументОснование_ДоговорКонтрагента) Тогда
		ШаблонПоУмолчанию = Истина;
		Возврат;
	КонецЕсли;
	
	ШаблонЗаполнения = уатОбщегоНазначения.ШаблонЗаполненияПоУслугам(
		ДокументОснование_ДоговорКонтрагента, ПолучательУслуг, ШаблонПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Если ШаблонПоУмолчанию Тогда
		Элементы.ДобавитьНастройкуПоДоговору.Видимость  = Истина;
		Элементы.ВыбратьНастройкуПоДоговору.Видимость   = Ложь;
		Элементы.ГруппаСтраницыНастроек.ТекущаяСтраница = Элементы.ГруппаСтраницаСтандартныйШаблон;
	Иначе
		Элементы.ДобавитьНастройкуПоДоговору.Видимость  = Ложь;
		Элементы.ВыбратьНастройкуПоДоговору.Видимость   = Истина;
		Элементы.ГруппаСтраницыНастроек.ТекущаяСтраница = Элементы.ГруппаСтраницаШаблонПоДоговору;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтобразитьИнформациюПоНастройкам()

	НадписьВидыДокументов = Справочники.уатШаблоныЗаполненияПоУслугам.ПредставлениеВидыДокументов(ШаблонЗаполнения);
	
	Если ПустаяСтрока(НадписьВидыДокументов) Тогда
		НадписьВидыДокументов = "<не указано>";
	Иначе
		НадписьВидыДокументов = Лев(НадписьВидыДокументов, СтрДлина(НадписьВидыДокументов) - 2);
	КонецЕсли;
	
	НадписьСверткаПоПолямДетализации = ?(ШаблонЗаполнения.СворачиватьПоПолямДетализации, "Используется", "Не используется");
	
	Если ШаблонЗаполнения.СортировкаЗаказов = 0 Тогда
		НадписьСортировкаЗаказов = "По дате документа";
	ИначеЕсли ШаблонЗаполнения.СортировкаЗаказов = 1 Тогда
		НадписьСортировкаЗаказов = "По времени отправления";
	ИначеЕсли ШаблонЗаполнения.СортировкаЗаказов = 2 Тогда
		НадписьСортировкаЗаказов = "По времени прибытия";
	КонецЕсли;
	
	Элементы.ГруппаШаблон.Заголовок = СтрШаблон("Используется шаблон ""%1""", ШаблонЗаполнения);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция КлючЗаписиРегистраНастроек(ДокументОснование_Контрагент, ДокументОснование_ДоговорКонтрагента)
	СтруктураЗаписи = Новый Структура("Контрагент, Договор",
		ДокументОснование_Контрагент, ДокументОснование_ДоговорКонтрагента);
	КлючЗаписи = РегистрыСведений.уатНастройкиЗаполненияПоУслугам.СоздатьКлючЗаписи(СтруктураЗаписи);
	Возврат КлючЗаписи;
КонецФункции

#КонецОбласти
